
<template>
  <!--    模块内容一-->
  <div>
    <div class="main">
      <div class="borde">{{mcTitle}}</div>
      <div id="splashes"></div>
    </div>
  </div>
</template>
<script>
import echarts from "echarts";

export default {
  name: "MC05",
  data() {
    return {
      mcList: "",
      mcId: ""
    };
  },
  props: ["mcStatus", "mcTitle"],
  watch: {
    mcStatus: function(val) {
      this.mcStatus = val;
    },
    mcTitle: function(val) {
      this.mcTitle = val;
    }
  },
  mounted() {
    var self = this;
    this.mcList = this.$common.mcList;
    console.log(this.mcStatus);
    // this.mcId = this.$common.menuList[0].mb.mk[Number(self.mcStatus)].mc.id;

    this.drawLine();
  },
  created() {},
  methods: {
    drawLine() {
      // 基于准备好的dom，初始化echarts实例
      // let splashes = this.$echarts.init(document.getElementById("splashes"));
      // 绘制图表
      var dom = document.getElementById("splashes");
      var myChart = echarts.init(dom);
      var app = {};
      var option = null;

      myChart.showLoading();

      var data = {
        counties: [
          "陈家营",
          "火车北站",
          "大河梗",
          "席子营",
          "东华",
          "大塘子",
          "莲花池",
          "小菜园",
          "大树营",
          "黑土",
          "牛街庄",
          "菊华",
          "昆明东站",
          "小喜村",
          "洋甫",
          "螺狮湾北",
          "螺狮湾",
          "昆明南站",
          "龙街"
        ],
        timeline: [
          "2018年9月",
          "2018年10月",
          "2018年11月",
          "2018年12月",
          "2019年1月",
          "2019年2月",
          "2019年3月",
          "2019年4月",
          "2019年5月",
          "2019年6月",
          "2019年7月",
          "2018年8月"
        ],
        series: [
          [
            [815, 34.05, 351014, "小菜园", "2018年9月"],
            [1314, 39, 645526, "大树营", "2018年9月"],
            [985, 32, 321675013, "陈家营", "2018年9月"],
            [864, 32.2, 345043, "黑土", "2018年9月"],
            [1244, 36.5731262, 977662, "牛街庄", "2018年9月"],
            [1803, 33.96717024, 29355111, "大塘子", "2018年9月"],
            [1639, 38.37, 22886919, "莲花池", "2018年9月"],
            [926, 42.84559912, 61428, "菊华", "2018年9月"],
            [1052, 25.4424, 168574895, "东华", "2018年9月"],
            [1050, 36.4, 30294378, "昆明东站", "2018年9月"],
            [579, 26, 4345000, "小喜村", "2018年9月"],
            [576, 25.8, 9395000, "洋甫", "2018年9月"],
            [658, 34.05, 100000, "螺狮湾北", "2018年9月"],
            [1278, 37.91620899, 868570, "螺狮湾", "2018年9月"],
            [1213, 35.9, 9508747, "昆明南站", "2018年9月"],
            [1430, 29.5734572, 31088398, "席子营", "2018年9月"],
            [1221, 35, 9773456, "龙街", "2018年9月"],
            [3431, 38.6497603, 12327466, "大河梗", "2018年9月"],
            [2128, 39.41, 6801854, "火车北站", "2018年9月"]
          ],
          [
            [834, 34.05, 342440, "小菜园", "2018年10月"],
            [1400, 39.01496774, 727603, "大树营", "2018年10月"],
            [985, 32, 350542958, "陈家营", "2018年10月"],
            [970, 33.64, 470176, "黑土", "2018年10月"],
            [1267, 36.9473378, 1070625, "牛街庄", "2018年10月"],
            [1839, 37.4, 30293172, "大塘子", "2018年10月"],
            [1759, 38.37, 23882461, "莲花池", "2018年10月"],
            [928, 43.13915533, 61428, "菊华", "2018年10月"],
            [1051, 25.4424, 171940819, "东华", "2018年10月"],
            [1064, 36.40397538, 30645903, "昆明东站", "2018年10月"],
            [573, 26, 4345000, "小喜村", "2018年10月"],
            [570, 25.8, 9395000, "洋甫", "2018年10月"],
            [659, 34.05, 100000, "螺狮湾北", "2018年10月"],
            [1299, 36.47500606, 918398, "螺狮湾", "2018年10月"],
            [1260, 35.9, 9960687, "昆明南站", "2018年10月"],
            [1447, 29.5734572, 31088398, "席子营", "2018年10月"],
            [1223, 35, 9923007, "龙街", "2018年10月"],
            [3575, 38.34738144, 14106058, "大河梗", "2018年10月"],
            [2283, 39.41, 8294928, "火车北站", "2018年10月"]
          ],
          [
            [853, 34.05, 334002, "小菜园", "2018年11月"],
            [1491, 39.02993548, 879432, "大树营", "2018年11月"],
            [985, 32, 380055273, "陈家营", "2018年11月"],
            [1090, 35.04, 607664, "黑土", "2018年11月"],
            [1290, 37.29122269, 1190807, "牛街庄", "2018年11月"],
            [1876, 39.21, 31549988, "大塘子", "2018年11月"],
            [1887, 38.37, 25507768, "莲花池", "2018年11月"],
            [929, 36.56365268, 62498, "菊华", "2018年11月"],
            [1050, 25.4424, 176225709, "东华", "2018年11月"],
            [1079, 36.40795077, 30993147, "昆明东站", "2018年11月"],
            [567, 26, 4353556, "小喜村", "2018年11月"],
            [564, 25.8, 9408016, "洋甫", "2018年11月"],
            [660, 34.05, 100000, "螺狮湾北", "2018年11月"],
            [1320, 46.96239815, 995904, "螺狮湾", "2018年11月"],
            [1309, 35.9, 10508375, "昆明南站", "2018年11月"],
            [1464, 29.5734572, 31861526, "席子营", "2018年11月"],
            [1225, 35, 10118315, "龙街", "2018年11月"],
            [3403, 41.31247671, 16221883, "大河梗", "2018年11月"],
            [2242, 39.41, 10361646, "火车北站", "2018年11月"]
          ],
          [
            [1399, 34.05, 348143, "小菜园", "2018年12月"],
            [1651, 39.04490323, 1202146, "大树营", "2018年12月"],
            [986, 32, 402373519, "陈家营", "2018年12月"],
            [1224, 35.74, 772812, "黑土", "2018年12月"],
            [1360, 36.29644969, 1327905, "牛街庄", "2018年12月"],
            [1799, 39.56, 33174810, "大塘子", "2018年12月"],
            [2024, 38.37, 28016571, "莲花池", "2018年12月"],
            [1036, 40.5022162, 65604, "菊华", "2018年12月"],
            [1052, 25.4424, 182214537, "东华", "2018年12月"],
            [1094, 36.41192615, 31330455, "昆明东站", "2018年12月"],
            [561, 26, 4377749, "小喜村", "2018年12月"],
            [559, 25.8, 9444785, "洋甫", "2018年12月"],
            [661, 34.05, 91723, "螺狮湾北", "2018年12月"],
            [1403, 45.75400094, 1115667, "螺狮湾", "2018年12月"],
            [1360, 35.9, 11232857, "昆明南站", "2018年12月"],
            [1562, 29.5734572, 34134430, "席子营", "2018年12月"],
            [1292, 35, 10398375, "龙街", "2018年12月"],
            [3661, 43.01830917, 18533999, "大河梗", "2018年12月"],
            [2552, 39.41, 13480460, "火车北站", "2018年12月"]
          ],
          [
            [2269, 34.05, 434095, "小菜园", "2019年1月"],
            [1922, 40.19012, 1745604, "大树营", "2019年1月"],
            [986, 32, 411213424, "陈家营", "2019年1月"],
            [1374, 36.48, 975565, "黑土", "2019年1月"],
            [1434, 41.46900965, 1467238, "牛街庄", "2019年1月"],
            [2184, 40.37, 34854476, "大塘子", "2019年1月"],
            [2102, 38.37, 31016143, "莲花池", "2019年1月"],
            [1155, 31.97, 70010, "菊华", "2019年1月"],
            [1053, 25.4424, 189298397, "东华", "2019年1月"],
            [1110, 36.41590154, 31663783, "昆明东站", "2019年1月"],
            [556, 26, 4410700, "小喜村", "2019年1月"],
            [553, 25.8, 9494784, "洋甫", "2019年1月"],
            [662, 34.05, 82479, "螺狮湾北", "2019年1月"],
            [1604, 45.61661054, 1252476, "螺狮湾", "2019年1月"],
            [1413, 35.9, 12090161, "昆明南站", "2019年1月"],
            [1666, 29.5734572, 37420913, "席子营", "2019年1月"],
            [1362, 35, 10731241, "龙街", "2019年1月"],
            [4149, 39.92715263, 20737251, "大河梗", "2019年1月"],
            [2792, 39.41, 17942443, "火车北站", "2019年1月"]
          ],
          [
            [3267, 34.05, 742619, "小菜园", "2019年2月"],
            [2202, 40.985432, 2487811, "大树营", "2019年2月"],
            [985, 32, 402711280, "陈家营", "2019年2月"],
            [1543, 36.26, 1181650, "黑土", "2019年2月"],
            [1512, 37.35415172, 1607810, "牛街庄", "2019年2月"],
            [2146, 43.28, 36277905, "大塘子", "2019年2月"],
            [2182, 38.37, 33663143, "莲花池", "2019年2月"],
            [1287, 36.61, 74711, "菊华", "2019年2月"],
            [1055, 25.4424, 196657653, "东华", "2019年2月"],
            [1125, 36.41987692, 32223184, "昆明东站", "2019年2月"],
            [550, 26, 4443898, "小喜村", "2019年2月"],
            [547, 25.8, 9558873, "洋甫", "2019年2月"],
            [1898, 34.05, 94934, "螺狮湾北", "2019年2月"],
            [1675, 49.53, 1401619, "螺狮湾", "2019年2月"],
            [1468, 35.9, 13219914, "昆明南站", "2019年2月"],
            [1778, 29.5734572, 41023821, "席子营", "2019年2月"],
            [1436, 35, 11074762, "龙街", "2019年2月"],
            [4480, 42.8, 22623571, "大河梗", "2019年2月"],
            [3059, 39.41, 24136293, "火车北站", "2019年2月"]
          ],
          [
            [4795, 34.05, 1256048, "小菜园", "2019年3月"],
            [2406, 41.541504, 3231465, "大树营", "2019年3月"],
            [1023, 28.85, 380047548, "陈家营", "2019年3月"],
            [1733, 36.24, 1324000, "黑土", "2019年3月"],
            [1594, 38.15099864, 1734254, "牛街庄", "2019年3月"],
            [3086, 43.33, 37461341, "大塘子", "2019年3月"],
            [2509, 38.37, 36383150, "莲花池", "2019年3月"],
            [1435, 19.76, 79662, "菊华", "2019年3月"],
            [1056, 23, 204966302, "东华", "2019年3月"],
            [1168, 36.42385231, 33176900, "昆明东站", "2019年3月"],
            [545, 26, 4542395, "小喜村", "2019年3月"],
            [542, 25.8, 9650608, "洋甫", "2019年3月"],
            [3674, 34.05, 157114, "螺狮湾北", "2019年3月"],
            [2033, 50, 1580366, "螺狮湾", "2019年3月"],
            [1525, 35.9, 14848599, "昆明南站", "2019年3月"],
            [1896, 29.5734572, 44966686, "席子营", "2019年3月"],
            [1514, 35, 11428718, "龙街", "2019年3月"],
            [5268, 43.01, 24783522, "大河梗", "2019年3月"],
            [3714, 39.41, 31936643, "火车北站", "2019年3月"]
          ],
          [
            [5431, 34.05, 1724213, "小菜园", "2019年4月"],
            [2815, 42.460624, 3817167, "大树营", "2019年4月"],
            [1099, 31.95714286, 363661158, "陈家营", "2019年4月"],
            [1946, 29.66, 1424672, "黑土", "2019年4月"],
            [1897, 45.66140699, 1847468, "牛街庄", "2019年4月"],
            [3297, 36.41, 38170355, "大塘子", "2019年4月"],
            [2819, 38.37, 39702235, "莲花池", "2019年4月"],
            [1599, 38.37, 84941, "菊华", "2019年4月"],
            [1058, 25.4424, 213725049, "东华", "2019年4月"],
            [1213, 36.59264, 34638021, "昆明东站", "2019年4月"],
            [539, 26, 4656353, "小喜村", "2019年4月"],
            [536, 25, 9741935, "洋甫", "2019年4月"],
            [5156, 34.05, 301045, "螺狮湾北", "2019年4月"],
            [2483, 50.86, 1746718, "螺狮湾", "2019年4月"],
            [1584, 35.9, 17013787, "昆明南站", "2019年4月"],
            [2023, 31.12082604, 49288504, "席子营", "2019年4月"],
            [1597, 35, 11871788, "龙街", "2019年4月"],
            [6046, 40.95, 27651628, "大河梗", "2019年4月"],
            [4058, 39.41, 40821569, "火车北站", "2019年4月"]
          ],
          [
            [7120, 39.34215686, 2253007, "小菜园", "2019年5月"],
            [3021, 44.512464, 4360348, "大树营", "2019年5月"],
            [1015, 32, 365544192, "陈家营", "2019年5月"],
            [2185, 36.84, 1555081, "黑土", "2019年5月"],
            [1925, 39.67, 2047577, "牛街庄", "2019年5月"],
            [3555, 42.73, 39014053, "大塘子", "2019年5月"],
            [3057, 38.905, 43577358, "莲花池", "2019年5月"],
            [2035, 42.32, 90546, "菊华", "2019年5月"],
            [1084, 25.4424, 223020377, "东华", "2019年5月"],
            [1395, 37.03648, 36826469, "昆明东站", "2019年5月"],
            [534, 26, 4798574, "小喜村", "2019年5月"],
            [531, 25.8, 9806394, "洋甫", "2019年5月"],
            [6241, 38.51282051, 505065, "螺狮湾北", "2019年5月"],
            [2827, 51.91, 1883716, "螺狮湾", "2019年5月"],
            [1848, 35, 19669587, "昆明南站", "2019年5月"],
            [2158, 30.20106663, 53996807, "席子营", "2019年5月"],
            [1535, 35, 12474351, "龙街", "2019年5月"],
            [6553, 43.78, 30849957, "大河梗", "2019年5月"],
            [5292, 39.41, 51256498, "火车北站", "2019年5月"]
          ],
          [
            [7418, 44.63431373, 3088808, "小菜园", "2019年6月"],
            [3963, 45.12972, 4908078, "大树营", "2019年6月"],
            [918, 32, 377135349, "陈家营", "2019年6月"],
            [2454, 39.54, 1658274, "黑土", "2019年6月"],
            [2305, 44.61, 2358344, "牛街庄", "2019年6月"],
            [3639, 43.36, 40015501, "大塘子", "2019年6月"],
            [3733, 40.91, 48211294, "莲花池", "2019年6月"],
            [2009, 36.58, 96517, "菊华", "2019年6月"],
            [1163, 24.384, 232819584, "东华", "2019年6月"],
            [1606, 37.67568, 39878734, "昆明东站", "2019年6月"],
            [528, 26, 4959044, "小喜村", "2019年6月"],
            [526, 25.8, 9856047, "洋甫", "2019年6月"],
            [6265, 42.97564103, 669985, "螺狮湾北", "2019年6月"],
            [3251, 48.6, 2003954, "螺狮湾", "2019年6月"],
            [2156, 37.41086957, 22618933, "昆明南站", "2019年6月"],
            [2233, 29.93047652, 59151534, "席子营", "2019年6月"],
            [1838, 35, 13188522, "龙街", "2019年6月"],
            [7169, 44.75, 34215580, "大河梗", "2019年6月"],
            [5646, 45.21, 63810074, "火车北站", "2019年6月"]
          ],
          [
            [6688, 49.92647059, 3743708, "小菜园", "2019年7月"],
            [4858, 48.288448, 5530806, "大树营", "2019年7月"],
            [894, 32, 395184556, "陈家营", "2019年7月"],
            [2756, 33.11248, 1762227, "黑土", "2019年7月"],
            [2789, 41.8, 2633389, "牛街庄", "2019年7月"],
            [4314, 45.08, 40628638, "大塘子", "2019年7月"],
            [4596, 43.915, 55293434, "莲花池", "2019年7月"],
            [2352, 46.64, 102913, "菊华", "2019年7月"],
            [1194, 18.35, 243073946, "东华", "2019年7月"],
            [1840, 38.6, 44040263, "昆明东站", "2019年7月"],
            [523, 26, 5124044, "小喜村", "2019年7月"],
            [520, 25.8, 9926633, "洋甫", "2019年7月"],
            [7181, 47.43846154, 815519, "螺狮湾北", "2019年7月"],
            [3643, 53.47, 2214923, "螺狮湾", "2019年7月"],
            [2583, 40.4326087, 24700965, "昆明南站", "2019年7月"],
            [3087, 30.74960789, 64836675, "席子营", "2019年7月"],
            [1985, 35, 13946634, "龙街", "2019年7月"],
            [8013, 46.32, 37995759, "大河梗", "2019年7月"],
            [6819, 48.92818182, 77415610, "火车北站", "2019年7月"]
          ],
          [
            [8695, 55.21862745, 4408209, "小菜园", "2019年8月"],
            [6794, 52.123024, 7181200, "大树营", "2019年8月"],
            [991, 32, 417830774, "陈家营", "2019年8月"],
            [3095, 35.21936, 2268558, "黑土", "2019年8月"],
            [3192, 48.53, 2930441, "牛街庄", "2019年8月"],
            [4542, 51.37, 41294572, "大塘子", "2019年8月"],
            [5162, 48.40833333, 64064129, "莲花池", "2019年8月"],
            [3012, 52.67, 109714, "菊华", "2019年8月"],
            [1391, 23.18032, 253761202, "东华", "2019年8月"],
            [1998, 39.9736, 49314848, "昆明东站", "2019年8月"],
            [544, 24.097344, 5293486, "小喜村", "2019年8月"],
            [538, 24.097344, 10193929, "洋甫", "2019年8月"],
            [8896, 51.90128205, 1044340, "螺狮湾北", "2019年8月"],
            [4332, 57.99, 2383631, "螺狮湾", "2019年8月"],
            [2846, 43.45434783, 26493422, "昆明南站", "2019年8月"],
            [3487, 31.40217766, 71044207, "席子营", "2019年8月"],
            [2144, 35, 14746479, "龙街", "2019年8月"],
            [8305, 53.99, 41804912, "大河梗", "2019年8月"],
            [8287, 51.8, 93559186, "火车北站", "2019年8月"]
          ]
        ]
      };
      myChart.hideLoading();

      var itemStyle = {
        normal: {
          opacity: 0.8,
          shadowBlur: 10,
          shadowOffsetX: 0,
          shadowOffsetY: 0,
          shadowColor: "rgba(0, 0, 0, 0.5)"
        }
      };

      var sizeFunction = function(x) {
        var y = Math.sqrt(x / 5e8) + 0.1;
        return y * 80;
      };
      // Schema:
      var schema = [
        { name: "Income", index: 0, text: "月累计客流量", unit: "万人次" },
        { name: "LifeExpectancy", index: 1, text: "车站面积", unit: "m²" },
        { name: "Population", index: 2, text: "月累计耗电量", unit: "kWh" },
        { name: "Country", index: 3, text: "车站名称", unit: "" }
      ];

      option = {
        baseOption: {
          timeline: {
            axisType: "category",
            orient: "vertical",
            autoPlay: true,
            inverse: true,
            playInterval: 2000,
            left: null,
            right: 0,
            top: 20,
            bottom: 10,
            width: 55,
            height: null,
            label: {
              normal: {
                textStyle: {
                  color: "#fff"
                }
              },
              emphasis: {
                textStyle: {
                  color: "#fff"
                }
              }
            },
            symbol: "none",
            lineStyle: {
              color: "#555"
            },
            checkpointStyle: {
              color: "#bbb",
              borderColor: "#777",
              borderWidth: 2
            },
            controlStyle: {
              showNextBtn: false,
              showPrevBtn: false,
              normal: {
                color: "#666",
                borderColor: "#666"
              },
              emphasis: {
                color: "#fff",
                borderColor: "#fff"
              }
            },
            data: []
          },

          tooltip: {
            padding: 5,
            backgroundColor: "#222",
            borderColor: "#777",
            borderWidth: 1,
            formatter: function(obj) {
              var value = obj.value;
              return (
                schema[3].text +
                "：" +
                value[3] +
                "<br>" +
                schema[1].text +
                "：" +
                value[1] +
                schema[1].unit +
                "<br>" +
                schema[0].text +
                "：" +
                value[0] +
                schema[0].unit +
                "<br>" +
                schema[2].text +
                "：" +
                value[2] +
                "<br>"
              );
            }
          },
          grid: {
            top: 80,
            bottom: 30,
            containLabel: true,
            left: 10,
            right: "110"
          },
          xAxis: {
            axisLine: {
              lineStyle: {
                color: "white"
              }
            },
            type: "log",
            name: "客流量",
            max: 10000,
            min: 300,
            nameGap: 25,
            nameLocation: "middle",
            nameTextStyle: {
              fontSize: 12
            },
            splitLine: {
              show: false
            },
            axisLine: {
              lineStyle: {
                color: "#fff"
              }
            },
            axisLabel: {
              formatter: "{value} 万人次"
            }
          },
          yAxis: {
            axisLine: {
              lineStyle: {
                color: "white"
              }
            },
            type: "value",
            name: "能耗",
            max: 100,
            nameTextStyle: {
              color: "#fff",
              fontSize: 12
            },
            axisLine: {
              lineStyle: {
                color: "#fff"
              }
            },
            splitLine: {
              show: false
            },
            axisLabel: {
              formatter: "{value} Kwh"
            }
          },
          visualMap: [
            {
              show: false,
              dimension: 3,
              categories: data.counties,
              calculable: true,
              precision: 0.1,
              textGap: 30,
              textStyle: {
                color: "#fff"
              },
              inRange: {
                color: (function() {
                  var colors = [
                    "#bcd3bb",
                    "#e88f70",
                    "#edc1a5",
                    "#9dc5c8",
                    "#e1e8c8",
                    "#7b7c68",
                    "#e5b5b5",
                    "#f0b489",
                    "#928ea8",
                    "#bda29a"
                  ];
                  return colors.concat(colors);
                })()
              }
            }
          ],
          series: [
            {
              type: "scatter",
              itemStyle: itemStyle,
              data: data.series[0],
              symbolSize: function(val) {
                return sizeFunction(val[2]);
              }
            }
          ],
          animationDurationUpdate: 1000,
          animationEasingUpdate: "quinticInOut"
        },
        options: []
      };

      for (var n = 0; n < data.timeline.length; n++) {
        option.baseOption.timeline.data.push(data.timeline[n]);
        option.options.push({
          title: {
            show: false,
            text: data.timeline[n] + ""
          },
          series: {
            name: data.timeline[n],
            type: "scatter",
            itemStyle: itemStyle,
            data: data.series[n],
            symbolSize: function(val) {
              return sizeFunction(val[2]);
            }
          }
        });
      }

      myChart.setOption(option);

      if (option && typeof option === "object") {
        myChart.setOption(option, true);
      }
    }
  }
};
</script>

<style scoped>
.main {
  color: #ffffff;
  padding: 1%;
  position: relative;
  width: 100%;
  height: 100%;
}
.borde {
  font-weight: 700;
  color: #3467c5;
  border-left: #3467c5 solid 4px;
  position: absolute;
  top: 4%;
  left: 6%;
  padding-left: 3%;
}
canvas {
  width: 100% !important;
  height: 100% !important;
  left: -6px !important;
  margin-top: 5% !important;
  margin-left: -5% !important;

}
#splashes {
  width: 470px;
  height: 278px;
}
</style>
